Download an process a csv file at link
http://research.stlouisfed.org/fred2/series/UNRATE/downloaddata/UNRATE.csv

1.   Whatâ€™s the header?
2.   Number of observations?
3.   Display the statistics
4.   Display the unemployment rates in year 2006
5.   Plot the unemployment rate from 2006 to 2012

For each question, create a code cell and write your program in it.

Driver- Bavin Patel
Observer 1- Sapna Patel
Observer 2- Yash Mitkari

In [3]:
import pandas as pd
df=pd.read_csv("http://research.stlouisfed.org/fred2/series/UNRATE/downloaddata/UNRATE.csv")

In [4]:
df.head()

         DATE  VALUE
0  1948-01-01    3.4
1  1948-02-01    3.8
2  1948-03-01    4.0
3  1948-04-01    3.9
4  1948-05-01    3.5

In [5]:
df.count()

DATE     884
VALUE    884
dtype: int64

In [6]:
df.describe()

            VALUE
count  884.000000
mean     5.767534
std      1.699536
min      2.500000
25%      4.500000
50%      5.600000
75%      6.800000
max     14.800000